STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA52CG/Applications/BLE/BLE_SerialCom_Peripheral/STM32_WPAN/App/app_ble.c
          if (p_pairing_complete->Status != 0)
          {
            APP_DBG_MSG("     - Pairing KO\n     - Status: 0x%02X\n     - Reason: 0x%02X\n",
                         p_pairing_complete->Status, p_pairing_complete->Reason);
          }
          else
          {
            APP_DBG_MSG("     - Pairing Success\n");
          }
          APP_DBG_MSG("\n");

          /* USER CODE BEGIN ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE*/

          /* USER CODE END ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE*/
          break;
        }
        case ACI_GAP_BOND_LOST_VSEVT_CODE:
        {
          APP_DBG_MSG(">>== ACI_GAP_BOND_LOST_EVENT\n");
          ret = aci_gap_allow_rebond(bleAppContext.BleApplicationContext_legacy.connectionHandle);
          if (ret != BLE_STATUS_SUCCESS)
          {
            APP_DBG_MSG("==>> aci_gap_allow_rebond : Fail, reason: 0x%02X\n", ret);
          }
          else
          {
            APP_DBG_MSG("==>> aci_gap_allow_rebond : Success\n");
          }
          /* USER CODE BEGIN ACI_GAP_BOND_LOST_VSEVT_CODE*/

          /* USER CODE END ACI_GAP_BOND_LOST_VSEVT_CODE*/
          break;
        }
        /* USER CODE BEGIN EVT_VENDOR_1 */
        case (ACI_L2CAP_COC_CONNECT_VSEVT_CODE):
        {
          aci_l2cap_coc_connect_event_rp0 *coc_connect_complete;
          coc_connect_complete = (aci_l2cap_coc_connect_event_rp0*)p_blecore_evt->data;
            
          APP_DBG_MSG(">>== ACI_L2CAP_COC_CONNECT_VSEVT_CODE\n");
          BleCoCContextPeriph.Conn_Handle = coc_connect_complete->Connection_Handle;
          BleCoCContextPeriph.Max_Transmission_Unit = coc_connect_complete->MTU;
          BleCoCContextPeriph.Max_Payload_Size = coc_connect_complete->MPS;
          BleCoCContextPeriph.Initial_Credits = coc_connect_complete->Initial_Credits;
          BleCoCContextPeriph.Channel_Number = coc_connect_complete->Channel_Number;
          BleCoCContextPeriph.SPSM = coc_connect_complete->SPSM;            
          
          ret = aci_l2cap_coc_connect_confirm(BleCoCContextPeriph.Conn_Handle, BleCoCContextPeriph.Max_Transmission_Unit, BleCoCContextPeriph.Max_Payload_Size, BleCoCContextPeriph.Initial_Credits, 0x0000, &Channel_Number, &Channel_Index_List); 
          BleCoCContextPeriph.Channel_Number = Channel_Number;
          BleCoCContextPeriph.Channel_Index_List = Channel_Index_List;
          bleAppContext.PeriphChannelIndex = BleCoCContextPeriph.Channel_Index_List;
          
          if (ret != BLE_STATUS_SUCCESS)
          {
            APP_DBG_MSG("==>> aci_l2cap_coc_connect_confirm : Fail, reason: 0x%02X\n", ret);
          } 
          else 
          {
            APP_DBG_MSG("==>> aci_l2cap_coc_connect_confirm : Success\n");
          }
          HandleNotification.CoC_Evt_Opcode = EXCHANGE_ATT_MTU;
          HandleNotification.ConnectionHandle = BleCoCContextPeriph.Conn_Handle;
          COC_PERIPH_APP_Notification(&HandleNotification);
          break;
        }
        case ACI_ATT_EXCHANGE_MTU_RESP_VSEVT_CODE:
        {
          aci_att_exchange_mtu_resp_event_rp0 * exchange_mtu_resp;
          exchange_mtu_resp = (aci_att_exchange_mtu_resp_event_rp0 *)p_blecore_evt->data;
          APP_DBG_MSG(">>== MTU_size = %d\n",exchange_mtu_resp->Server_RX_MTU );
          APP_DBG_MSG("\n");            
          APP_DBG_MSG("\n>>== CONNECTION READY\n");
          break;
        }        
        case (ACI_L2CAP_COC_RX_DATA_VSEVT_CODE):
        {
          aci_l2cap_coc_rx_data_event_rp0 *coc_rx_data_event;
          uint8_t i;

          coc_rx_data_event = (aci_l2cap_coc_rx_data_event_rp0*)p_blecore_evt->data;
          
          HandleNotification.CoC_Evt_Opcode = L2CAP_DATA_RECEIVED;
          HandleNotification.ConnectionHandle = bleAppContext.BleApplicationContext_legacy.connectionHandle;
          HandleNotification.DataLength = coc_rx_data_event->Length;
          HandleNotification.DataTransfered.pPayload = (coc_rx_data_event->Data);
          HandleNotification.DataTransfered.pPayload_n = *((uint32_t*) &(coc_rx_data_event->Data[0]));
          for (i = 0 ; i < HandleNotification.DataLength ; i++)
          {
            HandleNotification.DataTable[i] = coc_rx_data_event->Data[i];
          }
          /* periph */
          COC_PERIPH_APP_Notification(&HandleNotification);
          break;
        }
        /* USER CODE END EVT_VENDOR_1 */
      break; /* HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE */
      }
    }
      /* USER CODE BEGIN EVENT_PCKT */

      /* USER CODE END EVENT_PCKT */

    default:
      /* USER CODE BEGIN ECODE_DEFAULT*/

      /* USER CODE END ECODE_DEFAULT*/
      break;
  }

  return (SVCCTL_UserEvtFlowEnable);
}

APP_BLE_ConnStatus_t APP_BLE_Get_Server_Connection_Status(void)
{
  return bleAppContext.Device_Connection_Status;
}

/* USER CODE BEGIN FD*/

/* USER CODE END FD*/

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/
uint8_t HOST_BLE_Init(void)
{
  tBleStatus return_status = BLE_STATUS_FAILED;

  pInitParams.numAttrRecord           = CFG_BLE_NUM_GATT_ATTRIBUTES;
  pInitParams.numAttrServ             = CFG_BLE_NUM_GATT_SERVICES;
  pInitParams.attrValueArrSize        = CFG_BLE_ATT_VALUE_ARRAY_SIZE;
  pInitParams.prWriteListSize         = CFG_BLE_ATTR_PREPARE_WRITE_VALUE_SIZE;
  pInitParams.attMtu                  = CFG_BLE_ATT_MTU_MAX;
  pInitParams.max_coc_nbr             = CFG_BLE_COC_NBR_MAX;
  pInitParams.max_coc_mps             = CFG_BLE_COC_MPS_MAX;
  pInitParams.max_coc_initiator_nbr   = CFG_BLE_COC_INITIATOR_NBR_MAX;
  pInitParams.numOfLinks              = CFG_BLE_NUM_LINK;
  pInitParams.mblockCount             = CFG_BLE_MBLOCK_COUNT;
  pInitParams.bleStartRamAddress      = (uint8_t*)buffer;
  pInitParams.total_buffer_size       = BLE_DYN_ALLOC_SIZE;
  pInitParams.bleStartRamAddress_GATT = (uint8_t*)gatt_buffer;
  pInitParams.total_buffer_size_GATT  = BLE_GATT_BUF_SIZE;
  pInitParams.options                 = CFG_BLE_OPTIONS;
  pInitParams.debug                   = 0U;
/* USER CODE BEGIN HOST_BLE_Init_Params */

/* USER CODE END HOST_BLE_Init_Params */
  return_status = BleStack_Init(&pInitParams);
/* USER CODE BEGIN HOST_BLE_Init */

/* USER CODE END HOST_BLE_Init */
  return ((uint8_t)return_status);
}

static void Ble_Hci_Gap_Gatt_Init(void)
{
  uint8_t role;
  uint16_t gap_service_handle, gap_dev_name_char_handle, gap_appearance_char_handle;
  const uint8_t *p_bd_addr;

  uint16_t a_appearance[1] = {CFG_GAP_APPEARANCE};
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;

  /* USER CODE BEGIN Ble_Hci_Gap_Gatt_Init*/

  /* USER CODE END Ble_Hci_Gap_Gatt_Init*/

  APP_DBG_MSG("==>> Start Ble_Hci_Gap_Gatt_Init function\n");

  /**
   * Write the BD Address
   */
  p_bd_addr = BleGetBdAddress();
  ret = aci_hal_write_config_data(CONFIG_DATA_PUBADDR_OFFSET,
                                  CONFIG_DATA_PUBADDR_LEN,
                                  (uint8_t*) p_bd_addr);
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Fail   : aci_hal_write_config_data command - CONFIG_DATA_PUBADDR_OFFSET, result: 0x%02X\n", ret);
  }
  else
  {
    APP_DBG_MSG("  Success: aci_hal_write_config_data command - CONFIG_DATA_PUBADDR_OFFSET\n");
    APP_DBG_MSG("  Public Bluetooth Address: %02x:%02x:%02x:%02x:%02x:%02x\n",p_bd_addr[5],p_bd_addr[4],p_bd_addr[3],p_bd_addr[2],p_bd_addr[1],p_bd_addr[0]);
  }

  /* Write Identity root key used to derive LTK and CSRK */
  ret = aci_hal_write_config_data(CONFIG_DATA_IR_OFFSET, CONFIG_DATA_IR_LEN, (uint8_t*)a_BLE_CfgIrValue);
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Fail   : aci_hal_write_config_data command - CONFIG_DATA_IR_OFFSET, result: 0x%02X\n", ret);
  }
  else
  {
    APP_DBG_MSG("  Success: aci_hal_write_config_data command - CONFIG_DATA_IR_OFFSET\n");
  }

