STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA52CG/Applications/BLE/BLE_SerialCom_Peripheral/STM32_WPAN/App/app_ble.c
  /* Call SNVMA for storing - Without callback */
  SNVMA_Write (APP_BLE_NvmBuffer,
               BLE_NvmCallback);
}
/* USER CODE BEGIN FD_WRAP_FUNCTIONS */
static void Adv_Request(APP_BLE_ConnStatus_t NewStatus)
{
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
  bleAppContext.Device_Connection_Status = NewStatus;

  /* Start Fast or Low Power Advertising */
  ret = aci_gap_set_discoverable(ADV_TYPE,
                                 ADV_INTERVAL_MIN,
                                 ADV_INTERVAL_MAX,
                                 CFG_BD_ADDRESS_TYPE,
                                 ADV_FILTER,
                                 0,
                                 0,
                                 0,
                                 0,
                                 0,
                                 0);
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("==>> aci_gap_set_discoverable - fail, result: 0x%02X\n", ret);
  }
  else
  {
    APP_DBG_MSG("==>> aci_gap_set_discoverable - Success\n");
  }

  ret = aci_gap_delete_ad_type(AD_TYPE_TX_POWER_LEVEL);
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("==>> delete tx power level - fail\n");
  }

  /* Update Advertising data */
  ret = aci_gap_update_adv_data(sizeof(a_AdvData), (uint8_t*) a_AdvData);
  if (ret != BLE_STATUS_SUCCESS)
  {
      APP_DBG_MSG("==>> Start Fast Advertising Failed , result: 0x%02X\n", ret);
  }
  else
  {
      APP_DBG_MSG("==>> Success: Start Fast Advertising\n");
  }
  BleStackCB_Process();
  return;
}

void BLE_SVC_L2CAP_Conn_Update(uint16_t ConnectionHandle, uint16_t conn1, uint16_t conn2)
{
  tBleStatus ret;

  ret = aci_l2cap_connection_parameter_update_req(ConnectionHandle,
                                                  conn1, conn2,
                                                  0, 0x3E8);
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("BLE_SVC_L2CAP_Conn_Update(), Failed: 0x%02X\n", ret);
  }
  else
  {
    APP_DBG_MSG("BLE_SVC_L2CAP_Conn_Update(), Successfully\n");
  }

  BleStackCB_Process();
  return;
}
static void Connection_Interval_Update_Req(void)
{
  if (bleAppContext.Device_Connection_Status != APP_BLE_IDLE)
  {
    BLE_SVC_L2CAP_Conn_Update(bleAppContext.BleApplicationContext_legacy.connectionHandle, 
                              CONN_INT_MS(45), CONN_INT_MS(45));
  }
  BleStackCB_Process();
  return;
}

static void Periph_security_request(void)
{
  tBleStatus status;
  status = aci_gap_slave_security_req(bleAppContext.BleApplicationContext_legacy.connectionHandle);
  if (status != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("Periph security request cmd failure: 0x%02X\n", status);
  }
  else
  {
    APP_DBG_MSG("Periph security request cmd success\n");
  }
  BleStackCB_Process();
}

void APPE_Button2Action(void)
{
  tBleStatus status;
  if (bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_SERVER)
  {
    status = aci_gap_clear_security_db();
    if (status != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("Clear security DB cmd failure: 0x%02X\n", status);
    }
    else
    {
      APP_DBG_MSG("Clear security DB cmd success\n");
    }
  }
  else
  {
    APP_DBG_MSG("**PERIPH SECURITY REQ \n");
    UTIL_SEQ_SetTask(1U << CFG_TASK_PERIPH_SECURITY_REQ_ID, CFG_SEQ_PRIO_0);
  }
  return;
}
/* USER CODE END FD_WRAP_FUNCTIONS */
